# Cable Size Number Of Other Conductors Property

Source: https://www.revitapidocs.com/2026/f390f8d7-8b71-347c-8ea2-60de18d9307b.htm

---

| Cable Size Number Of Other Conductors Property |
| --- |

The number of Other Conductors.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public int NumberOfOtherConductors { get; set; }
```

```
Public Property NumberOfOtherConductors As Integer
	Get
	Set
```

```
public:
property int NumberOfOtherConductors {
	int get ();
	void set (int value);
}
```

```
member NumberOfOtherConductors : int with get, set
```

#### Property Value

Int32 Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The given value for numberOfOtherConductors is negative. |

See Also

#### Reference

CableSize Class Autodesk.Revit.DB.Electrical Namespace